/* Напишете функциите като макроси:
1. функция AVG(x, y), която смята средното аритметично на две подадени
като параметър числа.
2. функция AVG, която смята средното аритметично на числата от
определен диапазон.
3. Напишете функцията повдигане на степен, която повдига х на степен у
4. Напишете функцията TOUPPER, която прави малката буква а в голяма А
5. Напишете функцията DISP((f), (x)), която показва резултата от функции
връщащи double като корен квадратен. DISP(sqrt, 3.0)
 Макрото трябва да се експандне до printf(“sqrt (%g) = %g\n”, 3.0, sqrt(3.0)); */
 #include <stdio.h>
 #include"20210224_10.h"

#ifndef _MYHEADER_H_
#define _MYHEADER_H_
#endif 
int main(void) {
    printf("The avg of sum of 3+5 = %f\n",avg(3,5));
    printf("The avg of sum in diapazon 1-10=%f\n",avgD(1,10));
    printf("The sum of 2^3=%d\n",p(2,3));
   
return 0;
}